app/Controllers/Scoreboard.php

    public function store()
    {
        // "now" starts the match right away, "later" saves it as scheduled
        $mode        = $this->request->getPost('mode') === 'later' ? 'later' : 'now';
        $scheduledAt = null;

        if ($mode === 'later') {
            $scheduledAt = $this->parseDateTime($this->request->getPost('scheduled_at'));

            if ($scheduledAt === null) {
                return redirect()->back()
                    ->withInput()
                    ->with('error', 'Please choose a valid date and time for the scheduled match.');
            }
        }

        $logoA = $this->saveLogo('logo_a');
        $logoB = $this->saveLogo('logo_b');

        // false = a file was uploaded but it is not a valid image
        if ($logoA === false || $logoB === false) {
            return redirect()->back()
                ->withInput()
                ->with('error', 'Logos must be PNG, JPG, WEBP or GIF images up to 2MB.');
        }

        // minutes per half (10, 15, 20 or custom), limited to 1-90
        $halfMinutes = min(90, max(1, (int) ($this->request->getPost('half_minutes') ?: 20)));

        $this->matchModel->insert([
            'team_a'    => $this->request->getPost('team_a'),
            'team_b'    => $this->request->getPost('team_b'),
            'logo_a'    => $logoA,
            'logo_b'    => $logoB,
            'half_minutes' => $halfMinutes,
            'time_left' => $halfMinutes * 60,
            'status'    => $mode === 'later' ? 'scheduled' : 'live',
            'scheduled_at' => $scheduledAt,
        ]);
---
INSERT INTO `matches` (`team_a`, `team_b`, `logo_a`, `logo_b`, `half_minutes`, `time_left`, `status`, `scheduled_at`, `created_at`, `updated_at`) VALUES ('FCB', 'CFC', NULL, NULL, 15, 900, 'scheduled', '2026-10-07 14:00:00', '2026-10-07 02:14:15', '2026-10-07 02:14:15')

        $id = $this->matchModel->getInsertID();

        if ($mode === 'later') {
            return redirect()->to('/scoreboard/history')
                ->with('success', 'Match scheduled for ' . date('M d, Y h:i A', strtotime($scheduledAt)) . '.');
---
SELECT *
FROM `matches`
ORDER BY `id` DESC

    public function history()
    {
        $from = $this->validDate($this->request->getGet('from'));
        $to   = $this->validDate($this->request->getGet('to'));

        // only accept known statuses; anything else means "all"
        $status = $this->request->getGet('status');
        $status = in_array($status, ['scheduled', 'live', 'finished'], true) ? $status : null;

        // backwards range: swap it
        if ($from && $to && $from > $to) {
            [$from, $to] = [$to, $from];
        }

        if ($from) {
            $this->matchModel->where('COALESCE(scheduled_at, created_at) >=', $from . ' 00:00:00');
        }

        if ($to) {
            $this->matchModel->where('COALESCE(scheduled_at, created_at) <=', $to . ' 23:59:59');
        }

        if ($status) {
            $this->matchModel->where('status', $status);
        }

        $matches = $this->matchModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `matches`
ORDER BY `id` DESC

    public function update($id)
    {
        $match = $this->matchModel->find($id);
---
SELECT *
FROM `matches`
WHERE `matches`.`id` = '14'

        }

        if ($data) {
            $this->matchModel->update($id, $data);
---
UPDATE `matches` SET `score_a` = 4, `score_b` = 2, `fouls_a` = 0, `fouls_b` = 0, `time_left` = 593, `status` = 'finished', `finished_at` = '2026-10-07 02:13:25', `updated_at` = '2026-10-07 02:13:25'
WHERE `matches`.`id` IN ('14')