app/Controllers/Scoreboard.php

    public function match($id)
    {
        $match = $this->matchModel->find($id);
---
SELECT *
FROM `matches`
WHERE `matches`.`id` = '8'

    public function update($id)
    {
        $match = $this->matchModel->find($id);
---
SELECT *
FROM `matches`
WHERE `matches`.`id` = '8'

        }

        if ($data) {
            $this->matchModel->update($id, $data);
---
UPDATE `matches` SET `score_a` = 2, `score_b` = 1, `fouls_a` = 0, `fouls_b` = 0, `time_left` = 585, `status` = 'finished', `finished_at` = '2026-10-06 08:23:18', `updated_at` = '2026-10-06 08:23:18'
WHERE `matches`.`id` IN ('8')